import {ChangeLog} from "@/lib/type"

export function getChangeLogs(): ChangeLog[] {
    return [
        {
            version: "0.1.0",
            changes: ["ایجاد رابط کاربری ماشین حساب","ساخت بخش تاریخچه"],
        },
        {
            version: "0.5.0",
            changes: ["ساخت و پیکربندی سایت","استفاده از api برای تاریخچه"],
        },
        {
            version: "0.9.0",
            changes: ["راه اندازی برای تست","تغییر رنگ بندی"],
        },
        {
            version: "1.0.0",
            changes: ["بهبود رابط کاربری","رفع ایرادات گزارش داده شده","راه اندازی عمومی"]
        },
        {
            version: "1.1.5",
            changes: ["تغییر رابط کاربری","رفع اشکالات جزِِئی",""]
        },
        {
            version: "1.6.0",
            changes: ["اضافه شدن بخش تغییرات","رفع اشکالات جزِِئی"]
        },
        {
            version: "1.7.0",
            changes: ["تغییر رابط کاربری","رفع ایرادات کلی"]
        },
        {
            version: "1.8.0",
            changes: ["اضافه شدن پرانتز","تغییر نمایش خطا ها","بهبود رابط کاربری"]
        },
        {
            version: "2.0.0",
            changes: ["اضافه شدن بخش messenger","رفع ایرادات جزئی","بهبود رابط کاربری","بهینه سازی برای گوشی","افزایش سرعت"]
        },
        {
            version: "2.1.0",
            changes: ["اضافه شدن قابلیت کار با دکمه کیبورد در ماشین حساب"]
        },
        {
            version: "3.0.0",
            changes: ["اضافه شدن حساب کاربری","اضافه شدن بخش یادداشت","بهبود رابط کاربری","رفع ایرادات جزئی"]
        },
        {
            version: "3.1.0",
            changes: ["بهینه سازی برای زبان فارسی","بهبود رابط کاربری","رفع ایرادات جزئی"]
        },
        {
            version: "3.2.0",
            changes: ["افزایش امنیت","بهبود رابط کاربری","رفع ایرادات جزئی"]
        },
        {
            version: "3.2.0",
            changes: ["اضافه شدن لیست انجام وضایف","بهبود رابط کاربری","رفع ایرادات جزئی"]
        },
    ];
};