import {ChangeLog} from "@/lib/type"

export function getChangeLogs(): ChangeLog[] {
    return [
        {
            version: "0.1.0",
            changes: ["ایجاد رابط کاربری ماشین حساب","ساخت بخش تاریخچه"],
        },
        {
            version: "0.5.0",
            changes: ["ساخت و پیکربندی سایت","استفاده از api برای تاریخچه"],
        },
        {
            version: "0.9.0",
            changes: ["راه اندازی برای تست","تغییر رنگ بندی"],
        },
        {
            version: "1.0.0",
            changes: ["بهبود رابط کاربری","رفع ایرادات گزارش داده شده","راه اندازی عمومی"]
        },
        {
            version: "1.1.5",
            changes: ["تغییر رابط کاربری","رفع اشکالات جزِِئی",""]
        },
        {
            version: "1.6.0",
            changes: ["اضافه شدن بخش تغییرات","رفع اشکالات جزِِئی"]
        },
        {
            version: "1.7.0",
            changes: ["تغییر رابط کاربری","رفع ایرادات کلی"]
        },
        {
            version: "1.8.0",
            changes: ["اضافه شدن پرانتز","بهبود نمایش خطا ها"]
        },
    ];
};